ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hal_pvt.c
        case CY_FLASH_DRV_INVALID_INPUT_PARAMETERS:
        case CY_FLASH_DRV_INVALID_FLASH_ADDR:
            bleReturn = CY_BLE_ERROR_INVALID_PARAMETER;
            break;

        default:
            bleReturn = CY_BLE_ERROR_FLASH_WRITE;
            break;
    }

    return(bleReturn);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_NvramNonBlockingRowWrite
****************************************************************************//**
*
*  This function writes one row to the NVRAM store. It will check the
*  appropriate alignment of a start address and also perform an address range
*  check based on the length before performing the write operation.
*  This function performs memory compare and writes only row where there are new
*  data to write.
*
*  If function returns CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS
*  it means that writing is no complete yet and require to invoke again to get finish. 
*
*  This function is designated for internal usage.
*
* \param buffer:   Pointer to the buffer containing the data to be stored.
* \param varFlash: Pointer to the array or variable in the flash.
* \param length:   The length of the data in bytes.
*
* \return
*  CY_BLE_SUCCESS                       A successful write
*  CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS  Row writing in progress
*  CY_BLE_ERROR_INVALID_PARAMETER       At least one of the input parameters is invalid
*  CY_BLE_ERROR_FLASH_WRITE             Error in flash Write
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HAL_NvramNonBlockingRowWrite(const uint8_t buffer[],
                                                           const uint8_t varFlash[],
                                                           uint32_t length)
{
    static cy_en_ble_api_result_t nvramState = CY_BLE_SUCCESS;
    static cy_en_syspm_simo_buck_voltage1_t simoVoltage = CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_1_1V;
    static cy_en_syspm_ldo_voltage_t ldoVoltage = CY_SYSPM_LDO_VOLTAGE_1_1V;
    static uint32_t writeBuffer[CY_FLASH_SIZEOF_ROW / sizeof(uint32_t)] = {0x00};
    
    cy_en_flashdrv_status_t rc = CY_FLASH_DRV_SUCCESS;
       
    uint32_t rowId;
    uint32_t dstIndex;
    uint32_t srcIndex = 0u;
    uint32_t eeOffset = (uint32_t)varFlash;
    uint32_t byteOffset;
    uint8_t *writeBufferPointer;  

    bool rowNotEqual = false;
    bool restoreCoreVoltage = false;
     
    writeBufferPointer = (uint8_t*)writeBuffer;

    /* Make sure, that varFlash[] points to Flash or WFlash */
    if((((eeOffset >= CY_FLASH_BASE) && ((eeOffset + length) <= (CY_FLASH_BASE + CY_FLASH_SIZE))) ||
       ((eeOffset >= CY_WFLASH_BASE) && ((eeOffset + length) <= (CY_WFLASH_BASE + CY_WFLASH_SIZE)))) &&
        (length <= CY_FLASH_SIZEOF_ROW)
    )
    {
        eeOffset -= CY_FLASH_BASE;
        rowId = eeOffset / CY_FLASH_SIZEOF_ROW;
        byteOffset = CY_FLASH_SIZEOF_ROW * rowId;
        
        switch (nvramState)
        {
            /* Start write row */
            case CY_BLE_SUCCESS:
            case CY_BLE_ERROR_FLASH_WRITE:
            case CY_BLE_ERROR_INVALID_PARAMETER:
            
                /* Copy data to the write buffer either from the source buffer or from the flash 
                   and check if row programming is required */
                for(dstIndex = 0u; dstIndex < CY_FLASH_SIZEOF_ROW; dstIndex++)
                {
                    if((byteOffset >= eeOffset) && (srcIndex < length))
                    {
                        writeBufferPointer[dstIndex] = buffer[srcIndex];
                        
                        /* Detect that row programming is required */
                        if((rowNotEqual == false) && (CY_GET_REG8(CY_FLASH_BASE + byteOffset) != buffer[srcIndex]))
                        {
                            rowNotEqual = true;
                        }
                        srcIndex++;
                    }
                    else
                    {
                        writeBufferPointer[dstIndex] = CY_GET_REG8(CY_FLASH_BASE + byteOffset);
                    }
                    byteOffset++;
                }

                /* Start a new write */
                if(rowNotEqual != false)
                {         
                    /* Increase core voltage for write to flash operation */
                    if(Cy_SysPm_SimoBuckIsEnabled())
                    {
                        simoVoltage = Cy_SysPm_SimoBuckGetVoltage1();
                        if(simoVoltage == CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V)
                        {   /* Increase core voltage for write to flash operation */
                            Cy_SysPm_SimoBuckSetVoltage1(CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_1_1V);
                        }
                    }  
                    if(Cy_SysPm_LdoIsEnabled())
                    {
                        ldoVoltage = Cy_SysPm_LdoGetVoltage();
                        if(ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V)
                        {   /* Increase core voltage for write to flash operation */
                            Cy_SysPm_LdoSetVoltage(CY_SYSPM_LDO_VOLTAGE_1_1V);
                        }
                    }
                                  
                    /* Write flash row */
                    rc = Cy_Flash_StartWrite((rowId * CY_FLASH_SIZEOF_ROW) + CY_FLASH_BASE, writeBuffer); 

                    if (rc != CY_FLASH_DRV_OPERATION_STARTED)
                    {      
                        /* We have error during start write, returns CY_BLE_ERROR_FLASH_WRITE and stop writing */
                        nvramState = CY_BLE_ERROR_FLASH_WRITE;
                        
                        /* Set flag for restore core voltage */
                        restoreCoreVoltage = true;
                    }
                    
                    nvramState = CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS;   
                }
                else
                {
                    nvramState = CY_BLE_SUCCESS;
                }
                break;
                 
            case CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS:
                
                /* Check the status of the Flash operation */
                rc = Cy_Flash_IsWriteComplete();
                
                if(rc == CY_FLASH_DRV_SUCCESS)
                {
                    nvramState = CY_BLE_SUCCESS;
                    restoreCoreVoltage = true;      
                }
                             
                if(rc == CY_FLASH_DRV_OPCODE_BUSY)
                {
                    nvramState = CY_BLE_INFO_FLASH_WRITE_IN_PROGRESS;
                }
                break;
                
            default:
                break;
        }
        
