ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hal_pvt.c
        /* Restore core voltage */
        if(restoreCoreVoltage == true)
        {  
            if((Cy_SysPm_SimoBuckIsEnabled()) && (simoVoltage == CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V))
            {   /* Return core voltage */   
                Cy_SysPm_SimoBuckSetVoltage1(CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V);
            }
            if((Cy_SysPm_LdoIsEnabled()) && (ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V))
            {   /* Return core voltage */
                Cy_SysPm_LdoSetVoltage(CY_SYSPM_LDO_VOLTAGE_0_9V);
            }  
        }
    }
    else
    {
        nvramState = CY_BLE_ERROR_INVALID_PARAMETER;
    }

    return(nvramState);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_NvramWriteIsBusy
****************************************************************************//**
*
* Reports the flash operation in the BLE host core is active
*
* \return
*   true  - flash operation is active
*   false - no flash activity
*
*******************************************************************************/
bool Cy_BLE_HAL_NvramWriteIsBusy(void)
{
    uint32_t ipcChanNum;
    bool retVal = true;
    
    /* Select CY_IPC_CHAN_SYSCAL regarding to host core */
    #if (CY_BLE_HOST_CORE == CY_CPU_CORTEX_M4)
        ipcChanNum = CY_IPC_CHAN_SYSCALL_CM4;
    #else
        ipcChanNum = CY_IPC_CHAN_SYSCALL_CM0;
    #endif  /* (CY_CPU_CORTEX_M0P) */
    
    /* Checks if the IPC structure is not locked */
    if (Cy_IPC_Drv_IsLockAcquired((IPC_STRUCT_Type*) &IPC->STRUCT[ipcChanNum]) == false)
    {
       retVal = false;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_CalcCRC8
****************************************************************************//**
*
* Implements CRC-8 calculation
*
* \param data 
* The data to be used to calculate the CRC.
*
* \param length 
* The length of data.
*
* \return 
* The calculated CRC value.
*
*******************************************************************************/
uint8_t Cy_BLE_HAL_CalcCRC8(uint8_t data[], uint32_t length)
{
    /* CRC-8 constants */
    const uint8_t CY_BLE_HAL_CRC8_SEED = 0x00u;
    const uint8_t CY_BLE_HAL_CRC8_POLYNOM = 0x31u;
    const uint8_t CY_BLE_HAL_CRC8_POLYNOM_LEN = 0x8u;
    
    uint8_t crc = CY_BLE_HAL_CRC8_SEED;
    uint8_t i;

    while(0u != length)
    {
        crc ^= *data;
        for (i = 0u; i < CY_BLE_HAL_CRC8_POLYNOM_LEN; i++)
        {
            crc = (0x80u == (((uint16_t)crc) & 0x80u)) ? 
                  ((uint8_t)(((uint8_t)(crc << 1u)) ^ CY_BLE_HAL_CRC8_POLYNOM)) : ((uint8_t)(crc << 1u));
        }
        data++;
        length--;
    }

    return crc;
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_GetIcPackageType
****************************************************************************//**
*
*  This function returns package type
*
* return:
*  0 - BGA package
*  1 - CSP package
*  
*******************************************************************************/
/*******************************************************************************
* Function Name: Cy_BLE_HAL_GetIcPackageType
****************************************************************************//**
*
*  This function returns package type
*
* return:
*  0 - BGA package
*  1 - CSP package
*  
*******************************************************************************/
uint32_t Cy_BLE_HAL_GetIcPackageType(void)
{
    return((CY_GPIO_PACKAGE_TYPE == CY_GPIO_PACKAGE_CSP) ? 1u : 0u);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_DelayUs
****************************************************************************//**
*
*  Interface to Cy_SysLib_DelayUs function.
*
*******************************************************************************/
void Cy_BLE_HAL_DelayUs(uint16_t delayVal)
{
    Cy_SysLib_DelayUs(delayVal);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_DelayMs
****************************************************************************//**
*
*  Interface to Cy_SysLib_Delay function.
*
*******************************************************************************/
void Cy_BLE_HAL_DelayMs(uint32_t delayVal)
{
    Cy_SysLib_Delay(delayVal);
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_EnableGlobalInterrupts
****************************************************************************//**
*
*  This function enables all interrupt used by the component.
*
*******************************************************************************/
void Cy_BLE_HAL_EnableGlobalInterrupts(void)
{
#if (CY_BLE_STACK_MODE_HOST_UART)
    Cy_BLE_HAL_HOST_UART_IsrEnable();
#endif /* (CY_BLE_STACK_MODE_HOST_UART) */

#if (CY_BLE_CONFIG_STACK_MODE_CONTR_UART)
    Cy_BLE_HAL_UART_IsrEnable();
#endif /* (CY_BLE_CONFIG_STACK_MODE_CONTR_UART) */

/* Enable IPC interrupt */
#if (CY_BLE_STACK_MODE_IPC)
    Cy_BLE_Ipc_Cypipe_Isr_Enable();
#endif  /* (CY_BLE_CONFIG_STACK_CONTR_CORE) */

#if (CY_BLE_CONFIG_STACK_CONTR_CORE)
    NVIC_EnableIRQ((IRQn_Type)cy_ble_configPtr->blessIsrConfig->intrSrc);
#endif  /* (CY_BLE_CONFIG_STACK_CONTR_CORE) */
}


/*******************************************************************************
* Function Name: Cy_BLE_HAL_DisableGlobalInterrupts
****************************************************************************//**
*
*  This disables all interrupt used by the component.
*
*******************************************************************************/
void Cy_BLE_HAL_DisableGlobalInterrupts(void)
{
#if (CY_BLE_STACK_MODE_HOST_UART)
    Cy_BLE_HAL_HOST_UART_IsrDisable();
#endif /* (CY_BLE_STACK_MODE_HOST_UART) */

#if (CY_BLE_CONFIG_STACK_MODE_CONTR_UART)
    Cy_BLE_HAL_UART_IsrDisable();
#endif /* (CY_BLE_CONFIG_STACK_MODE_CONTR_UART) */

/* Disable IPC interrupt */
#if (CY_BLE_STACK_MODE_IPC)
    Cy_BLE_Ipc_Cypipe_Isr_Disable();
#endif /* (CY_BLE_STACK_MODE_IPC) */

#if (CY_BLE_CONFIG_STACK_CONTR_CORE)
    NVIC_DisableIRQ((IRQn_Type)cy_ble_configPtr->blessIsrConfig->intrSrc);
#endif /* (CY_BLE_CONFIG_STACK_CONTR_CORE) */
}

/* Stack Interface to clock */

